/***********************

   包文件中的文件信息

*/

#ifndef SHUIHUCARD_CFG_H
#define SHUIHUCARD_CFG_H

#include <memory.h>
#include <string.h>

// s_aShuiHuPak[编号] =  文件大小

int s_aShuiHuPak[109] = {
	0, 
	87938, 100129, 57302, 40163, 37315, 60569, 45954, 57027, 37079,67301,	//1-10
	58203, 34853, 26123, 29972, 75727, 53330, 27925, 42158, 34296, 37460,	//11-20
	65361, 31188, 29197, 115009, 44949, 66215, 26763, 34037, 44287, 24476,	//21-30
	28186, 66358, 79520, 39357, 37882, 59898, 68178, 67831, 97545, 88293,	//31-40
	76741, 76284, 48087, 74148, 58172, 66595, 33215, 81067, 71574, 33380,	//41-50
	49347, 63340, 69772, 70168, 72329, 62951, 88289, 41553, 99809, 32244,	//51-60
	27287, 45193, 41014, 54737, 59002, 55038, 34649, 40866, 48224, 41869,	//61-70
	48251, 22566, 57006, 38205, 43383, 39734, 45923, 43440, 42711, 30729,	//71-80
	36365, 52733, 46798, 42017, 41167, 37894, 46910, 48302, 43586, 52909,	//81-90
	55179, 49563, 61181, 40779, 36664, 38924, 45906, 38951, 36483, 50434,	//91-100
	50072, 47520, 29326, 34073, 47493, 39900, 30025, 38622					//101-108
};



//计算偏移工具
class ToolOffset
{
public:
	ToolOffset(){
		memset(m_aOffset, 0, sizeof(m_aOffset));
	}

	void Init()
	{
		int nCurOffset = 0;
		for (int i = 1; i <= 108; ++i)
		{
			SetOffSetValue(i, nCurOffset);	
			nCurOffset += s_aShuiHuPak[i];
		}
	}

	void SetOffSetValue(int index, int nOffset)
	{
		if (index > 0 && index < 109 && nOffset > 0)
		{
			m_aOffset[index] = nOffset;
		}
	}

	int GetOffSet(int index)
	{
		if (index < 0 || index > 108)
			return -1;

		return m_aOffset[index];
	}

private:
	int	m_aOffset[109];
};



#endif